; domain
;; Star-prob actions take-2

(define (domain star-prob)
  (:requirements :strips)
  (:predicates (On ?obj ?obj)
               (At ?obj ?obj)
               (Bigger ?obj ?obj)
               (Ring ?obj)
               (Outer ?obj)
               (Inner ?obj)
               (Empty ?obj)
               (Last ?obj)
               (Top ?obj))

  (:action MOVETOINNER_SINGLE_EMPTY_INNER
    :parameters(?r1 ?pi ?po)

    :precondition (and (Ring ?r1)
                       (Inner ?pi)
                       (Outer ?po)
                       (Top ?r1)
                       (Last ?r1)
                       (Empty ?pi)
                       (At ?r1 ?po)
                   )
    :effect (and (not (Empty ?pi))
                 (Empty ?po)
                 (not (At ?r1 ?po))
                 (At ?r1 ?pi)
            )
  )
  
  (:action MOVETOOUTER_SINGLE_EMPTY_OUTER
    :parameters(?r1 ?pi ?po)

    :precondition (and (Ring ?r1)
                       (Inner ?pi)
                       (Outer ?po)
                       (Top ?r1)
                       (Last ?r1)
                       (Empty ?po)
                       (At ?r1 ?pi)
                   )
    :effect (and (not (Empty ?po))
                 (Empty ?pi)
                 (not (At ?r1 ?pi))
                 (At ?r1 ?po)
            )
  )

  (:action OUTER_TOP_RING_TO_EMPTY_INNER
    :parameters (?r1 ?r2 ?pi ?po)
    :precondition (and (Ring ?r1) 
                       (Ring ?r2)
                       (Inner ?pi)
                       (Outer ?po)
                       (Empty ?pi)
                       (Top ?r1)
                       (On ?r1 ?r2)
                       (At ?r1 ?po)
                       (At ?r2 ?po)
                       (Bigger ?r2 ?r1)
                   )
     
   :effect (and (not (On ?r1 ?r2))
                (not (At ?r1 ?po))
                (not (Empty ?pi))
                (Top ?r2)
                (Last ?r1)
                (At ?r1 ?pi)
           )
  )

  (:action OUTER_TOP_RING_TO_INNER
    :parameters (?r1 ?r2 ?r3 ?pi ?po)
    :precondition (and (Ring ?r1)
                       (Ring ?r2)
                       (Ring ?r3)
                       (Inner ?pi)
                       (Outer ?po)
                       (On ?r1 ?r2)
                       (At ?r1 ?po)
                       (At ?r2 ?po)
                       (At ?r3 ?pi)
                       (Top ?r1)
                       (Top ?r3)
                       (Bigger ?r3 ?r1)
                 )

    :effect (and (not (At ?r1 ?po))
                 (not (Top ?r3))
                 (not (On ?r1 ?r2))
                 (On ?r1 ?r3)
                 (Top ?r2)
                 (At ?r1 ?pi)
            )
  )

  (:action OUTER_LAST_RING_TO_INNER
    :parameters (?r1 ?r2 ?pi ?po)
    :precondition (and (Ring ?r1)
                       (Ring ?r2)
                       (Inner ?pi)
                       (Outer ?po)
                       (Last ?r1)
                       (Top ?r1)
                       (Top ?r2)
                       (Bigger ?r2 ?r1)
                       (At ?r1 ?po)
                       (At ?r2 ?pi)
                   )
   :effect (and (not (At ?r1 ?po))
                (not (Top ?r2))
                (not (Last ?r1))
                (Empty ?po)
                (On ?r1 ?r2)
                (At ?r1 ?pi)
           )
  )
  
  (:action INNER_TOP_RING_TO_EMPTY_OUTER
    :parameters (?r1 ?r2 ?pi ?po)
    :precondition (and (Ring ?r1) 
                       (Ring ?r2)
                       (Inner ?pi)
                       (Outer ?po)
                       (Empty ?po)
                       (Top ?r1)
                       (On ?r1 ?r2)
                       (At ?r1 ?pi)
                       (At ?r2 ?pi)
                   )
     
   :effect (and (not (On ?r1 ?r2))
                (not (At ?r1 ?pi))
                (not (Empty ?po))
                (Top ?r2)
                (Last ?r1)
                (At ?r1 ?po)
           )
  )

  (:action INNER_TOP_RING_TO_OUTER
    :parameters (?r1 ?r2 ?r3 ?pi ?po)
    :precondition (and (Ring ?r1)
                       (Ring ?r2)
                       (Ring ?r3)
                       (Inner ?pi)
                       (Outer ?po)
                       (On ?r1 ?r2)
                       (At ?r1 ?pi)
                       (At ?r2 ?pi)
                       (At ?r3 ?po)
                       (Top ?r1)
                       (Top ?r3)
                       (Bigger ?r3 ?r1)
                 )
    :effect (and (not (At ?r1 ?pi))
                 (not (Top ?r3))
                 (not (On ?r1 ?r2))
                 (On ?r1 ?r3)
                 (Top ?r2)
                 (At ?r1 ?po)
            )
  )

  (:action INNER_LAST_RING_TO_OUTER
    :parameters (?r1 ?r2 ?pi ?po)
    :precondition (and (Ring ?r1)
                       (Ring ?r2)
                       (Inner ?pi)
                       (Outer ?po)
                       (Last ?r1)
                       (Top ?r1)
                       (Top ?r2)
                       (Bigger ?r2 ?r1)
                       (At ?r1 ?pi)
                       (At ?r2 ?po)
                   )
   :effect (and (not (At ?r1 ?pi))
                (not (Top ?r2))
                (not (Last ?r1))
                (Empty ?pi)
                (On ?r1 ?r2)
                (At ?r1 ?po)
           )
  )

)

; problem
;; Star Problem Take-2
(define (problem pb1)
  (:domain star-prob)
  (:objects R1 R2 R3 R4 R5 R6 A B C O)

  (:init
    ;;types
    (Inner O) (Empty O) 
    (Outer A) (Outer B) (Outer C)
    (Empty B) (Empty C)
    (Ring R1) (Ring R2) (Ring R3) (Ring R4) (Ring R5) (Ring R6)

    ;;locations
    (At R1 A)
    (At R2 A)
    (At R3 A)
    (At R4 A)
    (At R5 A)
    (At R6 A)

    ;;sizes
    (Bigger R1 R2)
    (Bigger R1 R3)
    (Bigger R1 R4)
    (Bigger R1 R5)
    (Bigger R1 R6)    

    (Bigger R2 R3)
    (Bigger R2 R4)
    (Bigger R2 R5)
    (Bigger R2 R6)

    (Bigger R3 R4)
    (Bigger R3 R5)
    (Bigger R3 R6)

    (Bigger R4 R5)
    (Bigger R4 R6)

    (Bigger R5 R6)

    ;;order
    (On R6 R5)
    (On R5 R4)
    (On R4 R3)
    (On R3 R2)
    (On R2 R1)
    (Top R6)
    (Last R1)

    ;;possibly add empty poles
  )

  (:goal
    (and (At R1 C)
         (At R2 C)
         (At R3 C)
         (At R4 C)
         (At R5 C)
         (At R6 C)
         (On R6 R5)
         (On R5 R4)
         (On R4 R3)
         (On R3 R2)
         (On R2 R1)
         (Top R6)
         (Last R1)
     )
  )
)

; plan
1. (outer_top_ring_to_empty_inner r6 r5 o a)
   deleted: (on r6 r5) (at r6 a) (empty o)
   added: (top r5) (last r6) (at r6 o)
   goals met: 6 of 13
2. (movetoouter_single_empty_outer r6 o b)
   deleted: (empty b) (at r6 o)
   added: (empty o) (at r6 b)
   goals met: 6 of 13
3. (outer_top_ring_to_empty_inner r5 r4 o a)
   deleted: (on r5 r4) (at r5 a) (empty o)
   added: (top r4) (last r5) (at r5 o)
   goals met: 5 of 13
4. (movetoouter_single_empty_outer r5 o c)
   deleted: (empty c) (at r5 o)
   added: (empty o) (at r5 c)
   goals met: 6 of 13
5. (outer_top_ring_to_empty_inner r4 r3 o a)
   deleted: (on r4 r3) (at r4 a) (empty o)
   added: (top r3) (last r4) (at r4 o)
   goals met: 5 of 13
6. (outer_last_ring_to_inner r6 r4 o b)
   deleted: (at r6 b) (top r4) (last r6)
   added: (empty b) (on r6 r4) (at r6 o)
   goals met: 5 of 13
7. (inner_top_ring_to_outer r6 r4 r5 o c)
   deleted: (at r6 o) (top r5) (on r6 r4)
   added: (on r6 r5) (top r4) (at r6 c)
   goals met: 7 of 13
8. (movetoouter_single_empty_outer r4 o b)
   deleted: (empty b) (at r4 o)
   added: (empty o) (at r4 b)
   goals met: 7 of 13
9. (outer_top_ring_to_empty_inner r3 r2 o a)
   deleted: (on r3 r2) (at r3 a) (empty o)
   added: (top r2) (last r3) (at r3 o)
   goals met: 6 of 13
10. (outer_last_ring_to_inner r4 r3 o b)
   deleted: (at r4 b) (top r3) (last r4)
   added: (empty b) (on r4 r3) (at r4 o)
   goals met: 7 of 13
11. (inner_top_ring_to_outer r4 r3 r2 o a)
   deleted: (at r4 o) (top r2) (on r4 r3)
   added: (on r4 r2) (top r3) (at r4 a)
   goals met: 6 of 13
12. (movetoouter_single_empty_outer r3 o b)
   deleted: (empty b) (at r3 o)
   added: (empty o) (at r3 b)
   goals met: 6 of 13
13. (outer_top_ring_to_empty_inner r4 r2 o a)
   deleted: (on r4 r2) (at r4 a) (empty o)
   added: (top r2) (last r4) (at r4 o)
   goals met: 6 of 13
14. (inner_last_ring_to_outer r4 r3 o b)
   deleted: (at r4 o) (top r3) (last r4)
   added: (empty o) (on r4 r3) (at r4 b)
   goals met: 7 of 13
15. (outer_top_ring_to_empty_inner r2 r1 o a)
   deleted: (on r2 r1) (at r2 a) (empty o)
   added: (top r1) (last r2) (at r2 o)
   goals met: 6 of 13
16. (outer_top_ring_to_inner r6 r5 r2 o c)
   deleted: (at r6 c) (top r2) (on r6 r5)
   added: (on r6 r2) (top r5) (at r6 o)
   goals met: 4 of 13
17. (inner_top_ring_to_outer r6 r2 r1 o a)
   deleted: (at r6 o) (top r1) (on r6 r2)
   added: (on r6 r1) (top r2) (at r6 a)
   goals met: 4 of 13
18. (outer_last_ring_to_inner r5 r2 o c)
   deleted: (at r5 c) (top r2) (last r5)
   added: (empty c) (on r5 r2) (at r5 o)
   goals met: 3 of 13
19. (inner_top_ring_to_outer r5 r2 r4 o b)
   deleted: (at r5 o) (top r4) (on r5 r2)
   added: (on r5 r4) (top r2) (at r5 b)
   goals met: 4 of 13
20. (outer_top_ring_to_inner r6 r1 r2 o a)
   deleted: (at r6 a) (top r2) (on r6 r1)
   added: (on r6 r2) (top r1) (at r6 o)
   goals met: 4 of 13
21. (inner_top_ring_to_outer r6 r2 r5 o b)
   deleted: (at r6 o) (top r5) (on r6 r2)
   added: (on r6 r5) (top r2) (at r6 b)
   goals met: 5 of 13
22. (movetoouter_single_empty_outer r2 o c)
   deleted: (empty c) (at r2 o)
   added: (empty o) (at r2 c)
   goals met: 6 of 13
23. (movetoinner_single_empty_inner r1 o a)
   deleted: (empty o) (at r1 a)
   added: (empty a) (at r1 o)
   goals met: 6 of 13
24. (outer_last_ring_to_inner r2 r1 o c)
   deleted: (at r2 c) (top r1) (last r2)
   added: (empty c) (on r2 r1) (at r2 o)
   goals met: 6 of 13
25. (inner_top_ring_to_empty_outer r2 r1 o a)
   deleted: (on r2 r1) (at r2 o) (empty a)
   added: (top r1) (last r2) (at r2 a)
   goals met: 5 of 13
26. (movetoouter_single_empty_outer r1 o c)
   deleted: (empty c) (at r1 o)
   added: (empty o) (at r1 c)
   goals met: 6 of 13
27. (movetoinner_single_empty_inner r2 o a)
   deleted: (empty o) (at r2 a)
   added: (empty a) (at r2 o)
   goals met: 6 of 13
28. (inner_last_ring_to_outer r2 r1 o c)
   deleted: (at r2 o) (top r1) (last r2)
   added: (empty o) (on r2 r1) (at r2 c)
   goals met: 8 of 13
29. (outer_top_ring_to_empty_inner r6 r5 o b)
   deleted: (on r6 r5) (at r6 b) (empty o)
   added: (top r5) (last r6) (at r6 o)
   goals met: 7 of 13
30. (inner_last_ring_to_outer r6 r2 o c)
   deleted: (at r6 o) (top r2) (last r6)
   added: (empty o) (on r6 r2) (at r6 c)
   goals met: 8 of 13
31. (outer_top_ring_to_empty_inner r5 r4 o b)
   deleted: (on r5 r4) (at r5 b) (empty o)
   added: (top r4) (last r5) (at r5 o)
   goals met: 7 of 13
32. (movetoouter_single_empty_outer r5 o a)
   deleted: (empty a) (at r5 o)
   added: (empty o) (at r5 a)
   goals met: 7 of 13
33. (outer_top_ring_to_empty_inner r4 r3 o b)
   deleted: (on r4 r3) (at r4 b) (empty o)
   added: (top r3) (last r4) (at r4 o)
   goals met: 6 of 13
34. (outer_top_ring_to_inner r6 r2 r4 o c)
   deleted: (at r6 c) (top r4) (on r6 r2)
   added: (on r6 r4) (top r2) (at r6 o)
   goals met: 5 of 13
35. (inner_top_ring_to_outer r6 r4 r5 o a)
   deleted: (at r6 o) (top r5) (on r6 r4)
   added: (on r6 r5) (top r4) (at r6 a)
   goals met: 6 of 13
36. (inner_last_ring_to_outer r4 r2 o c)
   deleted: (at r4 o) (top r2) (last r4)
   added: (empty o) (on r4 r2) (at r4 c)
   goals met: 7 of 13
37. (movetoinner_single_empty_inner r3 o b)
   deleted: (empty o) (at r3 b)
   added: (empty b) (at r3 o)
   goals met: 7 of 13
38. (outer_top_ring_to_inner r4 r2 r3 o c)
   deleted: (at r4 c) (top r3) (on r4 r2)
   added: (on r4 r3) (top r2) (at r4 o)
   goals met: 7 of 13
39. (inner_top_ring_to_empty_outer r4 r3 o b)
   deleted: (on r4 r3) (at r4 o) (empty b)
   added: (top r3) (last r4) (at r4 b)
   goals met: 6 of 13
40. (inner_last_ring_to_outer r3 r2 o c)
   deleted: (at r3 o) (top r2) (last r3)
   added: (empty o) (on r3 r2) (at r3 c)
   goals met: 8 of 13
41. (movetoinner_single_empty_inner r4 o b)
   deleted: (empty o) (at r4 b)
   added: (empty b) (at r4 o)
   goals met: 8 of 13
42. (outer_top_ring_to_inner r6 r5 r4 o a)
   deleted: (at r6 a) (top r4) (on r6 r5)
   added: (on r6 r4) (top r5) (at r6 o)
   goals met: 7 of 13
43. (inner_top_ring_to_empty_outer r6 r4 o b)
   deleted: (on r6 r4) (at r6 o) (empty b)
   added: (top r4) (last r6) (at r6 b)
   goals met: 7 of 13
44. (inner_last_ring_to_outer r4 r3 o c)
   deleted: (at r4 o) (top r3) (last r4)
   added: (empty o) (on r4 r3) (at r4 c)
   goals met: 9 of 13
45. (movetoinner_single_empty_inner r5 o a)
   deleted: (empty o) (at r5 a)
   added: (empty a) (at r5 o)
   goals met: 9 of 13
46. (inner_last_ring_to_outer r5 r4 o c)
   deleted: (at r5 o) (top r4) (last r5)
   added: (empty o) (on r5 r4) (at r5 c)
   goals met: 11 of 13
47. (movetoinner_single_empty_inner r6 o b)
   deleted: (empty o) (at r6 b)
   added: (empty b) (at r6 o)
   goals met: 11 of 13
48. (inner_last_ring_to_outer r6 r5 o c)
   deleted: (at r6 o) (top r5) (last r6)
   added: (empty o) (on r6 r5) (at r6 c)
   goals met: 13 of 13
